{
	"awards": [],
	"basics": {
		"email": "yunielacosta738@gmail.com",
		"image": "/me.webp",
		"label": "Ingeniero de software experimentado en tecnologías frontend y backend. Dominio de principios de diseño de software, patrones de diseño y arquitecturas limpias.",
		"location": {
			"address": "🍃",
			"city": "valencia",
			"countryCode": "ES",
			"postalCode": "✉️",
			"region": "Valencia"
		},
		"name": "Yuniel Acosta",
		"phone": "+34 687 687 869",
		"profiles": [
			{
				"network": "X",
				"url": "https://x.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "GitHub",
				"url": "https://github.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "LinkedIn",
				"url": "https://www.linkedin.com/in/yacosta738/",
				"username": "yacosta738"
			},
			{
				"network": "Instagram",
				"url": "https://instagram.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "Codepen",
				"url": "https://codepen.io/yacosta738",
				"username": "yacosta738"
			}
		],
		"summary": "Ingeniero de software con aproximadamente 7 años de experiencia en desarrollo de software. Dominio de tecnologías frontend y backend. Entusiasta de la tecnología y la ciencia. Experiencia en Arquitectura de Aplicaciones Web, Principios de Diseño de Software y Patrones de Diseño de Software. Interesado en programación orientada a objetos, patrones de diseño, programación funcional, diseño dirigido por el dominio y microservicios. Soy una persona versátil con habilidades multidisciplinarias, con ganas de aprender y lista para enfrentar nuevos y difíciles retos dentro o fuera de mi país.",
		"url": "https://yunielacosta.com"
	},
	"certificates": [
		{
			"date": "2022-07-07",
			"issuer": "Udemy",
			"name": "Microservicios: Clean Architecture, DDD, SAGA, Outbox & Kafka",
			"url": "https://www.udemy.com/certificate/UC-5c9457a6-f77d-4152-a860-c6132c9a61f4/"
		},
		{
			"date": "2022-11-07",
			"issuer": "Udemy",
			"name": "Principios SOLID: Introducción a Arquitectura y Diseño de Software",
			"url": "https://ude.my/UC-f863b35b-c53c-4ea7-a2f9-ee6b534c0a36/"
		},
		{
			"date": "2023-02-07",
			"issuer": "Udemy",
			"name": "Master Spring Boot 3 & Spring Framework 6 con Java",
			"url": "https://ude.my/UC-d6269681-64c6-4fc5-b7dc-e83b10f4dc3b/"
		},
		{
			"date": "2023-02-17",
			"issuer": "Udemy",
			"name": "Keycloak: Single Sign On con Spring Boot & Spring Security",
			"url": "https://ude.my/UC-ea9fe04c-eae5-4f2f-a624-f04baad72e1f"
		},
		{
			"date": "2023-02-24",
			"issuer": "Udemy",
			"name": "Construye Apps Spring Boot con Kotlin",
			"url": "https://ude.my/UC-94e27fb3-0092-4347-b807-eeae99a2d158"
		},
		{
			"date": "2023-11-07",
			"issuer": "Canvas Credentials (Badgr)",
			"name": "Certificación Fundamental de Pruebas de Software (ASTFC)™",
			"url": "https://api.badgr.io/public/assertions/LRv0GmtiR-Sluyso7ElnWA"
		}
	],
	"education": [
		{
			"area": "Ciencia de la Computación",
			"courses": [
				"Inteligencia Artificial",
				"Máquinas Computadoras",
				"Programación Orientada a Objetos",
				"Ensablador",
				"Programación Web",
				"Sistemas de Bases de Datos (SQL y NoSQL)",
				"Compiladores",
				"Análisis y Diseño de Algoritmos",
				"Estructuras de Datos",
				"Lógica",
				"Matemática Computacional"
			],
			"endDate": "2013-01-01",
			"institution": "Universidad Central \"Marta Abreu\" de Las Villas",
			"score": "4.0",
			"startDate": "2011-01-01",
			"studyType": "Licenciatura",
			"url": "https://www.uclv.edu.cu"
		}
	],
	"interests": [
		{
			"keywords": ["Startups", "Automatización", "Herramientas de IA"],
			"name": "Tendencias Tecnológicas"
		},
		{
			"keywords": ["Fútbol", "Correr", "Ciclismo de montaña"],
			"name": "Actividades al aire libre"
		}
	],
	"languages": [
		{
			"fluency": "Nativo",
			"language": "Español"
		},
		{
			"fluency": "Intermedio B2",
			"language": "Inglés"
		}
	],
	"projects": [
		{
			"description": "Aplicación que permite garantizar el control de la disponibilidad financiera de la Empresa Eléctrica de Ciego de Ávila. Desarrollada con arquitectura monolítica usando Lumen en el backend y Angular en el frontend.",
			"highlights": ["angular", "typescript", "lumen", "php", "postgresql"],
			"name": "Finis",
			"startDate": "2018-09-05"
		},
		{
			"description": "Aplicación sencilla hecha en Flutter para una tienda online. Permite agregar, eliminar y editar objetos para vender, añadir a favoritos y realizar compras verificando el estado del pedido.",
			"highlights": ["flutter", "dart", "idea"],
			"name": "ShopApp",
			"startDate": "2020-12-06",
			"url": "https://github.com/yacosta738/flutter_shop_app"
		},
		{
			"description": "Aplicación sencilla hecha en Flutter para llevar el control de gastos personales diarios. Permite controlar cuánto se ha gastado semanal y diariamente.",
			"highlights": ["dart", "flutter"],
			"name": "ExpensesApp",
			"startDate": "2020-12-12",
			"url": "https://github.com/yacosta738/flutter_expenses_app"
		},
		{
			"description": "Aplicación sencilla hecha en Flutter donde se muestra una lista por categorías de platos e ingredientes.",
			"highlights": ["flutter", "dart", "idea"],
			"name": "MealApp",
			"startDate": "2020-12-25",
			"url": "https://github.com/yacosta738/flutter_meal_app"
		},
		{
			"description": "Módulo que permite a Odoo usar escáneres remotos en la misma subred.",
			"highlights": ["flask", "python", "libinsane"],
			"name": "scanner-odoo",
			"startDate": "2021-01-14"
		},
		{
			"description": "Permite controlar la producción avícola de la empresa CAN. Realizada con JHIPSTER, arquitectura monolítica, diseñada para multiempresas.",
			"highlights": ["java", "spring", "vuejs", "postgresql", "typescript"],
			"name": "Bankiva",
			"startDate": "2020-02-17"
		},
		{
			"description": "Mi primer blog personal hecho con el generador de sitios estáticos Jekyll y desplegado en Github Pages.",
			"highlights": ["jekyll", "ruby", "scss"],
			"name": "Personal Blog v1.0",
			"startDate": "2019-11-14",
			"url": "https://yacosta738.github.io/"
		},
		{
			"description": "Plantilla para blog personal y portafolio hecha con HUGO. Parte de la migración de mi blog personal a la versión 2 con el generador de sitios estáticos HUGO.",
			"highlights": ["hugo", "go", "scss"],
			"name": "Portfolio Blog V2",
			"startDate": "2020-03-12",
			"url": "https://yacosta738.github.io/nomada.digital/"
		},
		{
			"description": "Aplicación para buscar música usando la API de ITunes. Hecha con Vue 3, Vite y Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite", "itunes-api"],
			"name": "Buscador de música ITunes",
			"startDate": "2021-05-01",
			"url": "https://itunes-search-music.vercel.app/"
		},
		{
			"description": "Aplicación del clima que usa la API de Metaweather. Hecha con Vue 3, Vite y Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite"],
			"name": "Weather App",
			"startDate": "2021-05-21",
			"url": "https://weather-app-vuejs-acosta.vercel.app/"
		},
		{
			"description": "Aplicación de lista de tareas para demostrar conocimientos en React. Solo frontend, sin backend ni almacenamiento en base de datos.",
			"highlights": ["react", "css3", "html"],
			"name": "React ToDo App",
			"startDate": "2021-06-14",
			"url": "https://yacosta738.github.io/react-todos-app"
		},
		{
			"description": "Plantilla de proyecto simple, opinada, totalmente tipada y lista para producción hecha con Vue 3, TypeScript, Vite y Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite", "typescript"],
			"name": "Vue3 Starter",
			"startDate": "2021-10-21",
			"url": "https://vue3-vite-typescript-tailwind-starter.vercel.app/"
		},
		{
			"description": "Aplicación para gestionar una lista de tareas. Permite agregar, marcar como completada y eliminar tareas. Tiene tres vistas principales (Todas, Activas y Completadas)",
			"highlights": ["vuejs", "tailwind", "typescript", "vite", "nuxtjs"],
			"name": "Nuxt ToDo App",
			"startDate": "2022-01-05",
			"url": "https://task-app-acosta.vercel.app/"
		},
		{
			"description": "Plantilla de proyecto simple, opinada, totalmente tipada y lista para producción hecha con Vue 3, TypeScript, Vite y Tailwindcss.",
			"highlights": ["nuxtjs", "vuejs", "typescript", "vite", "tailwind"],
			"name": "Nuxt 3 Template",
			"startDate": "2022-01-05",
			"url": "https://nuxt3-tailwindcss-typescript.vercel.app/"
		},
		{
			"description": "MAN es una app de búsqueda de películas que muestra y ordena todas las películas disponibles en la API de TMDB. Construida con ReactJS, Tailwindcss y Typescript. Desplegada en Vercel.",
			"highlights": ["typescript", "react", "nextjs"],
			"name": "Movie App",
			"startDate": "2022-04-06",
			"url": "https://movie-app-nextjs-nine.vercel.app/"
		},
		{
			"description": "Sistema de pedidos de comida que utiliza arquitectura de microservicios con Kafka para la comunicación entre servicios y PostgreSQL como base de datos. Proyecto en desarrollo.",
			"highlights": ["java", "postgresql", "kafka"],
			"name": "Food Ordering System",
			"startDate": "2022-08-05",
			"url": "https://github.com/yacosta738/food-ordering-system"
		}
	],
	"publications": [],
	"references": [
		{
			"name": "Mayret Lodos",
			"reference": "He tenido el privilegio de conocer a Yuniel y he sido testigo de su tenacidad, compromiso y pasión por el desarrollo de software. Destaca por sus habilidades de liderazgo, demostradas en la toma de decisiones técnicas acertadas, el mantenimiento del equilibrio en el equipo y la integración de diferentes perspectivas para lograr los mejores resultados posibles.\n\nSu adaptabilidad a las tecnologías emergentes y su capacidad para diseñar soluciones efectivas lo convierten en un profesional de software altamente confiable. Además, su entusiasmo por el desarrollo va más allá de lo técnico: vive y respira programación, abordando cada proyecto con dedicación y excelencia, demostrando que para él no es solo una profesión, sino una verdadera vocación."
		},
		{
			"name": "Yuniesky Martinez Espinosa",
			"reference": "Enfocado, inteligente y movido por la curiosidad constante, Yuniel es un desarrollador full stack senior con gran experiencia en su campo y un amplio conocimiento de tecnologías y disciplinas complementarias. Integra rápidamente nuevos conocimientos y los aplica eficazmente para construir soluciones escalables y de alta calidad.\n\nSu capacidad para combinar una profunda experiencia técnica con una perspectiva interdisciplinaria le permite abordar proyectos complejos de manera holística, asegurando una arquitectura robusta, código mantenible y una mentalidad orientada a la eficiencia. Su sentido de la responsabilidad y rigor profesional entregan resultados de valor excepcional."
		}
	],
	"skills": [
		{
			"keywords": [
				"Java",
				"Kotlin",
				"Spring Boot",
				"Vert.x",
				"REST APIs",
				"Microservicios",
				"Principios SOLID"
			],
			"level": "Experto",
			"name": "Desarrollo Backend"
		},
		{
			"keywords": ["HTML", "CSS", "TypeScript", "Angular", "Vue.js"],
			"level": "Avanzado",
			"name": "Desarrollo Frontend"
		},
		{
			"keywords": [
				"PostgreSQL",
				"Oracle DB",
				"BigQuery",
				"MySQL",
				"MongoDB",
				"Optimización de consultas",
				"SQL"
			],
			"level": "Experto",
			"name": "Sistemas de Bases de Datos"
		},
		{
			"keywords": [
				"AWS",
				"Docker",
				"Kubernetes",
				"Terraform",
				"CI/CD",
				"GitLab CI",
				"Serverless",
				"Infraestructura como Código"
			],
			"level": "Experto",
			"name": "Cloud & DevOps"
		},
		{
			"keywords": [
				"Microservicios",
				"Arquitectura orientada a eventos",
				"Arquitectura limpia",
				"Alta disponibilidad",
				"Configuración centralizada",
				"Diseño de APIs"
			],
			"level": "Experto",
			"name": "Arquitectura de Sistemas"
		},
		{
			"keywords": [
				"Seguridad de APIs",
				"Políticas de riesgo",
				"Sistemas de scoring"
			],
			"level": "Avanzado",
			"name": "Seguridad y Gestión de Riesgos"
		},
		{
			"keywords": ["JUnit", "Pruebas automatizadas", "Revisión de código"],
			"level": "Avanzado",
			"name": "Testing y Aseguramiento de Calidad"
		},
		{
			"keywords": ["Git", "Docker", "Linux", "JHipster", "Istio", "Zookeeper"],
			"level": "Avanzado",
			"name": "Herramientas y Plataformas"
		}
	],
	"volunteer": [],
	"work": [
		{
			"endDate": "",
			"highlights": [
				"Colaboré con equipos multifuncionales para recopilar y analizar requisitos de negocio para sistemas de software.",
				"Diseñé, desarrollé e implementé soluciones de software siguiendo buenas prácticas y estándares de codificación.",
				"Realicé pruebas y aseguramiento de calidad para garantizar que el software cumpliera con los requisitos funcionales y de rendimiento.",
				"Proporcioné liderazgo técnico y mentoría a ingenieros y desarrolladores junior.",
				"Solucioné y resolví problemas técnicos relacionados con sistemas de software en entornos de producción y pruebas.",
				"Evalué tecnologías emergentes y metodologías de desarrollo para proponer mejoras y oportunidades de innovación.",
				"Participé en revisiones de código y contribuí a la definición de estándares y buenas prácticas de codificación.",
				"Desarrollé y mantuve documentación técnica, incluidos diagramas de arquitectura, guías de usuario y notas de lanzamiento.",
				"Colaboré con stakeholders para definir cronogramas, hitos y entregables de proyectos, comunicando el estado y riesgos a la dirección."
			],
			"name": "GFT",
			"position": "Analista de Sistemas | Ingeniero de Software Senior (L4)",
			"startDate": "2023-03-14",
			"summary": "Como incorporación reciente al equipo, actualmente trabajo con dedicación para lograr mis objetivos en el rol de Analista de Sistemas e Ingeniero de Software Senior. Colaboro con equipos multifuncionales para recopilar y analizar requisitos de negocio, diseñar e implementar soluciones de software robustas y brindar liderazgo técnico para asegurar entregas de alta calidad.",
			"url": "https://gft.com"
		},
		{
			"highlights": [
				"Colaboré con equipos multifuncionales para analizar requisitos de negocio y diseñar soluciones de software siguiendo buenas prácticas y estándares de codificación.",
				"Proporcioné liderazgo técnico y mentoría a desarrolladores junior; resolví problemas técnicos complejos para mantener la confiabilidad del sistema.",
				"Aseguré que el software cumpliera con los requisitos funcionales y de rendimiento mediante pruebas y actividades de aseguramiento de calidad.",
				"Evalué tecnologías y metodologías emergentes para identificar oportunidades de mejora e innovación.",
				"Comuniqué el estado del proyecto, hitos y riesgos a stakeholders y dirección para apoyar la toma de decisiones informada."
			],
			"name": "Deutsche Bank",
			"position": "Ingeniero de Software Senior",
			"startDate": "2023-04-08",
      "endDate": "2025-12-18",
			"summary": "Como Ingeniero de Software Senior en Deutsche Bank, aporto experiencia colaborando con equipos multifuncionales para analizar requisitos de negocio, diseñar y entregar soluciones de software que siguen buenas prácticas y altos estándares de codificación, asegurando que los sistemas cumplan objetivos funcionales y de rendimiento.",
			"url": "https://db.com"
		},
		{
			"endDate": "2023-03-10",
			"highlights": [
				"Desarrollé y mantuve APIs internas para detección de comportamientos maliciosos, mejorando la seguridad y previniendo amenazas; implementé políticas y scorers para detectar y prevenir usos maliciosos en registro y login para MercadoLibre.com y MercadoPago.com.",
				"Colaboré con equipos multifuncionales para diseñar e implementar soluciones de software escalables y eficientes para operaciones de e-commerce.",
				"Realicé pruebas y análisis exhaustivos para garantizar la confiabilidad y el rendimiento de las aplicaciones, minimizando tiempos de inactividad y mejorando la experiencia de usuario.",
				"Trabajé estrechamente con product managers y diseñadores para crear interfaces amigables y mejorar la experiencia de usuario.",
				"Implementé pruebas automatizadas y prácticas de integración continua para mejorar la calidad del software y reducir riesgos de despliegue.",
				"Participé en revisiones de código y contribuí al desarrollo de estándares y buenas prácticas de codificación.",
				"Colaboré con equipos DevOps para optimizar el rendimiento y la escalabilidad de las aplicaciones."
			],
			"name": "Mercado Libre",
			"position": "Ingeniero de Software",
			"startDate": "2022-11-08",
			"summary": "Como Ingeniero de Software en Mercado Libre, colaboré con equipos multifuncionales para recopilar y analizar requisitos de negocio, diseñé e implementé soluciones de software siguiendo buenas prácticas y estándares de codificación, y aseguré entregas de alta calidad mediante pruebas y aseguramiento de calidad.",
			"url": "https://mercadolibre.com"
		},
		{
			"endDate": "2022-11-01",
			"highlights": [
				"Mejoré la ejecución de sincronización de datos entre nuestras APIs y MMC de aproximadamente 40 minutos a ~6 minutos, reduciendo significativamente el tiempo de procesamiento y los costos operativos.",
				"Mejoré la calidad del código agregando pruebas unitarias e integrales y promoviendo principios SOLID en toda la base de código.",
				"Diseñé e implementé un patrón de configuración centralizada para todos los microservicios de la plataforma, simplificando despliegues y gestión de configuración.",
				"Implementé un sistema de integración continua con GitLab CI para permitir entregas rápidas y confiables de código actualizado, aumentando la eficiencia y reduciendo errores de entrega.",
				"Mantuve y optimicé APIs de alto tráfico para asegurar disponibilidad y rendimiento en múltiples integraciones de mercado."
			],
			"name": "Scanntech",
			"position": "Ingeniero de Software Senior | Desarrollador Backend Java",
			"startDate": "2021-09-01",
			"summary": "Como desarrollador de software en Scanntech, integré múltiples fuentes de datos y redes de retail mediante APIs, mantuve servicios backend de alta disponibilidad bajo tráfico intenso, mejoré la cobertura de pruebas e incrementé las pruebas de integración para aumentar la confiabilidad del sistema.",
			"url": "https://scanntech.com"
		},
		{
			"endDate": "2017-12-31",
			"highlights": [
				"Diseñé y desarrollé un sistema de gestión de reputación online basado en microservicios.",
				"Proporcioné liderazgo técnico y mentoría durante todo el ciclo de entrega.",
				"Entregué interfaces web (Angular/Vue) y APIs REST internas.",
				"Solucioné defectos críticos y realicé mejoras que optimizaron el rendimiento web.",
				"Tecnologías: HTML, CSS, TypeScript, Angular, Vue.js, Java, Spring Boot, JUnit, REST, SQL, PostgreSQL, PHP (Laravel), Python (Flask), Kubernetes, Istio, Docker, JHipster, Linux"
			],
			"name": "Desoft",
			"position": "Desarrollador Web",
			"startDate": "2017-09-01",
			"summary": "Desarrollé y mantuve interfaces web y sitios de clientes usando HTML, CSS y JavaScript. Aseguré compatibilidad entre navegadores y layouts responsivos.",
			"url": "https://www.desoft.cu"
		},
		{
			"endDate": "2020-08-09",
			"highlights": [
				"Desarrollé sitios web dinámicos e interactivos usando frameworks JS modernos, mejorando la experiencia de usuario y el tráfico.",
				"Diseñé procesos de limpieza y mejoras de rendimiento que minimizaron tiempos de inactividad y aumentaron la confiabilidad.",
				"Solucioné bugs e implementé mejoras que mejoraron significativamente la funcionalidad y velocidad del sitio.",
				"Desarrollé APIs internas para la comunicación entre diferentes sistemas."
			],
			"name": "Desoft",
			"position": "Desarrollador FullStack",
			"startDate": "2018-01-01",
			"summary": "Trabajé en frontend y backend para entregar soluciones web robustas; implementé APIs y mejoras de rendimiento.",
			"url": "https://www.desoft.cu"
		},
		{
			"endDate": "2021-09-01",
			"highlights": [
				"Capacité al personal en funciones web internas y guié al equipo en la implementación de nuevos requisitos de software.",
				"Lideré la adopción de arquitectura de microservicios y formé al personal en Kubernetes e Istio.",
				"Diseñé e implementé la arquitectura de microservicios para un sistema de gestión de reputación online."
			],
			"name": "Desoft",
			"position": "Arquitecto de Software",
			"startDate": "2020-08-21",
			"summary": "Lideré el diseño de arquitectura y mentoría; introduje patrones basados en microservicios y mejoras de plataforma.",
			"url": "https://www.desoft.cu"
		}
	]
}
