{
	"awards": [],
	"basics": {
		"email": "yunielacosta738@gmail.com",
		"image": "/me.webp",
		"label": "Experienced software engineer skilled in front-end and back-end technologies. Proficient in software design principles, design patterns, and clean architectures.",
		"location": {
			"address": "🍃",
			"city": "valencia",
			"countryCode": "ES",
			"postalCode": "✉️",
			"region": "Valencia"
		},
		"name": "Yuniel Acosta",
		"phone": "+34 687 687 869",
		"profiles": [
			{
				"network": "X",
				"url": "https://x.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "GitHub",
				"url": "https://github.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "LinkedIn",
				"url": "https://www.linkedin.com/in/yacosta738/",
				"username": "yacosta738"
			},
			{
				"network": "Instagram",
				"url": "https://instagram.com/yacosta738",
				"username": "yacosta738"
			},
			{
				"network": "Codepen",
				"url": "https://codepen.io/yacosta738",
				"username": "yacosta738"
			}
		],
		"summary": "Software engineer with approximately 7 years working in software development. Proficiency with front-end and back-end technologies. Technology and science enthusiast. I am experienced with Web Application Architecture, Software Design Principles, and Software Design Patterns. Interested in object-oriented programming, design patterns, functional programming, domain-driven design, and microservices. I am a versatile person with wide-ranging skills, eager to learn, and ready to face new and tough challenges in or out of my country.",
		"url": "https://yunielacosta.com"
	},
	"certificates": [
		{
			"date": "2022-07-07",
			"issuer": "Udemy",
			"name": "Microservices: Clean Architecture, DDD, SAGA, Outbox & Kafka",
			"url": "https://www.udemy.com/certificate/UC-5c9457a6-f77d-4152-a860-c6132c9a61f4/"
		},
		{
			"date": "2022-11-07",
			"issuer": "Udemy",
			"name": "SOLID Principles: Introducing Software Architecture & Design",
			"url": "https://ude.my/UC-f863b35b-c53c-4ea7-a2f9-ee6b534c0a36/"
		},
		{
			"date": "2023-02-07",
			"issuer": "Udemy",
			"name": "Master Spring Boot 3 & Spring Framework 6 with Java",
			"url": "https://ude.my/UC-d6269681-64c6-4fc5-b7dc-e83b10f4dc3b/"
		},
		{
			"date": "2023-02-17",
			"issuer": "Udemy",
			"name": "Keycloak : Single Sign On with Spring Boot & Spring Security",
			"url": "https://ude.my/UC-ea9fe04c-eae5-4f2f-a624-f04baad72e1f"
		},
		{
			"date": "2023-02-24",
			"issuer": "Udemy",
			"name": "Build Spring Boot Apps with the Kotlin Programming Language",
			"url": "https://ude.my/UC-94e27fb3-0092-4347-b807-eeae99a2d158"
		},
		{
			"date": "2023-11-07",
			"issuer": "Canvas Credentials (Badgr)",
			"name": "Accredited Software Testing Fundamentals Certification (ASTFC)™",
			"url": "https://api.badgr.io/public/assertions/LRv0GmtiR-Sluyso7ElnWA"
		}
	],
	"education": [
		{
			"area": "Software Development",
			"courses": [
				"Artificial intelligence",
				"Computer Machines",
				"Object-oriented programming",
				"Assembly",
				"Web programming",
				"Systems of Databases (SQL and NoSQL)",
				"Compilers",
				"Analysis and Design of Algorithms",
				"Data Structures",
				"Logic",
				"Computational Math"
			],
			"endDate": "2013-01-01",
			"institution": "Central University \"Marta Abreu\" of Las Villas",
			"score": "4.0",
			"startDate": "2011-01-01",
			"studyType": "Bachelor",
			"url": "https://www.uclv.edu.cu"
		}
	],
	"interests": [
		{
			"keywords": ["Startups", "Automation", "AI Tools"],
			"name": "Technology Trends"
		},
		{
			"keywords": ["Football", "Running", "Mountain Biking"],
			"name": "Outdoor Activities"
		}
	],
	"languages": [
		{
			"fluency": "Native speaker",
			"language": "Spanish"
		},
		{
			"fluency": "Intermediate B2",
			"language": "English"
		}
	],
	"projects": [
		{
			"description": "Application that allows to guarantee the control of the financial availability of the Electric Company of Ciego de Ávila. The application was developed with monolithic architecture using the Lumen framework on the backend and Angular on the frontend.",
			"highlights": ["angular", "typescript", "lumen", "php", "postgresql"],
			"name": "Finis",
			"startDate": "2018-09-05"
		},
		{
			"description": "A simple application made in Flutter for an online store. Where you can add, delete and edit objects to sell, add them to favorites and make a purchase checking the status of your order.",
			"highlights": ["flutter", "dart", "idea"],
			"name": "ShopApp",
			"startDate": "2020-12-06",
			"url": "https://github.com/yacosta738/flutter_shop_app"
		},
		{
			"description": "A simple application made in Flutter to keep track of your daily personal expenses. You can have control of how much you have spent weekly as well as daily.",
			"highlights": ["dart", "flutter"],
			"name": "ExpensesApp",
			"startDate": "2020-12-12",
			"url": "https://github.com/yacosta738/flutter_expenses_app"
		},
		{
			"description": "A simple application made in Flutter where a list by categories of the dishes and their ingredients is shown.",
			"highlights": ["flutter", "dart", "idea"],
			"name": "MealApp",
			"startDate": "2020-12-25",
			"url": "https://github.com/yacosta738/flutter_meal_app"
		},
		{
			"description": "Module that allows the ORM odoo to use scanners remotely that are on the same subnet.",
			"highlights": ["flask", "python", "libinsane"],
			"name": "scanner-odoo",
			"startDate": "2021-01-14"
		},
		{
			"description": "It allows keeping control of the poultry production of the CAN Company. Made using JHIPSTER, with a monolithic architecture, designed for multi-companies.",
			"highlights": ["java", "spring", "vuejs", "postgresql", "typescript"],
			"name": "Bankiva",
			"startDate": "2020-02-17"
		},
		{
			"description": "My first personal blog made with Jekyll static websites generator and deployed in Github Pages.",
			"highlights": ["jekyll", "ruby", "scss"],
			"name": "Personal Blog v1.0",
			"startDate": "2019-11-14",
			"url": "https://yacosta738.github.io/"
		},
		{
			"description": "Template for personal Blog and portfolio made with HUGO. The template is part of the migration of my personal blog in its version 2 with the static website generator HUGO.",
			"highlights": ["hugo", "go", "scss"],
			"name": "Portfolio Blog V2",
			"startDate": "2020-03-12",
			"url": "https://yacosta738.github.io/nomada.digital/"
		},
		{
			"description": "Application to search for music using the ITunes Api. Made with Vue 3, Vite and Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite", "itunes-api"],
			"name": "ITunes music search engine",
			"startDate": "2021-05-01",
			"url": "https://itunes-search-music.vercel.app/"
		},
		{
			"description": "A weather Application that use the Metaweather API. Made with Vue 3, Vite and Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite"],
			"name": "Weather App",
			"startDate": "2021-05-21",
			"url": "https://weather-app-vuejs-acosta.vercel.app/"
		},
		{
			"description": "A simple to-do list application to demonstrate my React knowledge. Front-end project only, no backend or database storage.",
			"highlights": ["react", "css3", "html"],
			"name": "React ToDo App",
			"startDate": "2021-06-14",
			"url": "https://yacosta738.github.io/react-todos-app"
		},
		{
			"description": "Simple, opinionated, fully typed, and production-ready project template made with Vue 3, TypeScript, Vite and Tailwindcss.",
			"highlights": ["vuejs", "tailwind", "vite", "typescript"],
			"name": "Vue3 Starter",
			"startDate": "2021-10-21",
			"url": "https://vue3-vite-typescript-tailwind-starter.vercel.app/"
		},
		{
			"description": "Application for manage a task list. It allows us add, mark as completed and delete a task. The App has three principal Views (All, Aactive and Completed)",
			"highlights": ["vuejs", "tailwind", "typescript", "vite", "nuxtjs"],
			"name": "Nuxt ToDo App",
			"startDate": "2022-01-05",
			"url": "https://task-app-acosta.vercel.app/"
		},
		{
			"description": "Simple, opinionated, fully typed, and production-ready project template made with Vue 3, TypeScript, Vite and Tailwindcss.",
			"highlights": ["nuxtjs", "vuejs", "typescript", "vite", "tailwind"],
			"name": "Nuxt 3 Template",
			"startDate": "2022-01-05",
			"url": "https://nuxt3-tailwindcss-typescript.vercel.app/"
		},
		{
			"description": "MAN is a movie search app that helps display and sort all movies available in the TMDB API. This App is built with ReactJS, Tailwindcss, and Typescript. Also, uses Vercel to deploy.",
			"highlights": ["typescript", "react", "nextjs"],
			"name": "Movie App",
			"startDate": "2022-04-06",
			"url": "https://movie-app-nextjs-nine.vercel.app/"
		},
		{
			"description": "This is a food ordering system that uses a microservice architecture with Kafka for inter-service communication and PostgreSQL as a database. It's a work in progress.",
			"highlights": ["java", "postgresql", "kafka"],
			"name": "Food Ordering System",
			"startDate": "2022-08-05",
			"url": "https://github.com/yacosta738/food-ordering-system"
		}
	],
	"publications": [],
	"references": [
		{
			"name": "Mayret Lodos",
			"reference": "I have had the privilege of knowing Yuniel and have witnessed firsthand his tenacity, commitment, and passion for software development. He stands out for his leadership skills, demonstrated in the way he makes sound technical decisions, maintains balance within the team, and integrates different perspectives to deliver the best possible outcomes.\n\nHis adaptability to evolving technologies and his ability to design effective solutions make him a highly reliable software professional. Moreover, his enthusiasm for development goes beyond the technical dimension: he breathes and bleeds programming, approaching each project with dedication and excellence, showing clearly that for him it is not just a profession, but a true vocation."
		},
		{
			"name": "Yuniesky Martinez Espinosa",
			"reference": "Focused, intelligent, and driven by constant curiosity, Yuniel is a senior full stack developer with strong expertise in his field and a broad understanding of complementary technologies and disciplines. He quickly integrates new knowledge and applies it effectively to build scalable, high-quality solutions.\n\nHis ability to combine deep technical expertise with a cross-disciplinary perspective allows him to approach complex projects holistically, ensuring robust architecture, maintainable code, and an efficiency-oriented mindset. His sense of responsibility and professional rigor consistently deliver results of exceptional value."
		}
	],
	"skills": [
		{
			"keywords": [
				"Java",
				"Kotlin",
				"Spring Boot",
				"Vert.x",
				"REST APIs",
				"Microservices",
				"SOLID Principles"
			],
			"level": "Expert",
			"name": "Backend Development"
		},
		{
			"keywords": ["HTML", "CSS", "TypeScript", "Angular", "Vue.js"],
			"level": "Advanced",
			"name": "Frontend Development"
		},
		{
			"keywords": [
				"PostgreSQL",
				"Oracle DB",
				"BigQuery",
				"MySQL",
				"MongoDB",
				"Query Optimization",
				"SQL"
			],
			"level": "Expert",
			"name": "Database Systems"
		},
		{
			"keywords": [
				"AWS",
				"Docker",
				"Kubernetes",
				"Terraform",
				"CI/CD",
				"GitLab CI",
				"Serverless",
				"Infrastructure as Code"
			],
			"level": "Expert",
			"name": "Cloud & DevOps"
		},
		{
			"keywords": [
				"Microservices",
				"Event-Driven Architecture",
				"Clean Architecture",
				"High Availability",
				"Centralized Configuration",
				"API Design"
			],
			"level": "Expert",
			"name": "System Architecture"
		},
		{
			"keywords": ["API Security", "Risk Policies", "Scoring Systems"],
			"level": "Advanced",
			"name": "Security & Risk Management"
		},
		{
			"keywords": ["JUnit", "Automated Testing", "Code Review"],
			"level": "Advanced",
			"name": "Testing & Quality Assurance"
		},
		{
			"keywords": ["Git", "Docker", "Linux", "JHipster", "Istio", "Zookeeper"],
			"level": "Advanced",
			"name": "Tools & Platforms"
		}
	],
	"volunteer": [],
	"work": [
		{
			"endDate": "",
			"highlights": [
				"Collaborated with cross-functional teams to gather and analyze business requirements for software systems.",
				"Designed, developed, and implemented software solutions following best practices and coding standards.",
				"Conducted testing and quality assurance to ensure software met functional and performance requirements.",
				"Provided technical leadership and mentorship to junior engineers and developers.",
				"Troubleshot and resolved technical issues related to software systems in production and staging environments.",
				"Evaluated emerging technologies and development methodologies to propose improvements and innovation opportunities.",
				"Participated in code reviews and contributed to the definition of coding standards and best practices.",
				"Developed and maintained technical documentation, including architecture diagrams, user guides, and release notes.",
				"Collaborated with stakeholders to define project timelines, milestones, and deliverables, and communicated project status and risks to management."
			],
			"name": "GFT",
			"position": "System Analyst | Senior Software Engineer (L4)",
			"startDate": "2023-03-14",
			"summary": "As a recent addition to the team, I am currently working diligently to achieve my objectives in my role as System Analyst and Senior Software Engineer. I collaborate with cross-functional teams to gather and analyze business requirements, design and implement robust software solutions, and provide technical leadership to ensure high-quality delivery.",
			"url": "https://gft.com"
		},
		{
			"endDate": "",
			"highlights": [
				"Collaborated with cross-functional teams to analyze business requirements and design software solutions adhering to best practices and coding standards.",
				"Provided technical leadership and mentorship to junior developers; troubleshot and resolved complex technical issues to maintain system reliability.",
				"Ensured software met functional and performance requirements through testing and quality assurance activities.",
				"Evaluated emerging technologies and methodologies to identify opportunities for improvement and innovation.",
				"Communicated project status, milestones, and risks to stakeholders and management to support informed decision-making."
			],
			"name": "Deutsche Bank",
			"position": "Senior Software Engineer",
			"startDate": "2023-04-08",
			"summary": "As a Senior Software Engineer at Deutsche Bank, I bring expertise in collaborating with cross-functional teams to analyze business requirements, designing and delivering software solutions that follow best practices and high coding standards, and ensuring systems meet functional and performance goals.",
			"url": "https://db.com"
		},
		{
			"endDate": "2023-03-10",
			"highlights": [
				"Developed and maintained internal APIs for malicious behavior detection, improving security and preventing potential threats; implemented policies and scorers to detect and prevent malicious use during registration and login for MercadoLibre.com and MercadoPago.com.",
				"Collaborated with cross-functional teams to design and implement scalable and efficient software solutions for e-commerce operations.",
				"Conducted thorough testing and analysis to ensure reliability and performance of applications, minimizing downtime and improving user experience.",
				"Worked closely with product managers and designers to create user-friendly interfaces and improve user experience.",
				"Implemented automated testing and continuous integration practices to enhance software quality and reduce deployment risks.",
				"Participated in code reviews and contributed to the development of coding standards and best practices.",
				"Collaborated with DevOps teams to optimize application performance and scalability."
			],
			"name": "Mercado Libre",
			"position": "Software Engineer",
			"startDate": "2022-11-08",
			"summary": "As a Software Engineer at Mercado Libre, I collaborated with cross-functional teams to gather and analyze business requirements, designed and implemented software solutions following best practices and coding standards, and ensured high-quality delivery through testing and quality assurance.",
			"url": "https://mercadolibre.com"
		},
		{
			"endDate": "2022-11-01",
			"highlights": [
				"Improved data synchronization execution between our APIs and MMC from approximately 40 minutes to ~6 minutes, significantly reducing processing time and operational costs.",
				"Improved code quality by adding unit and integration tests and promoting SOLID principles across the codebase.",
				"Designed and implemented a centralized configuration pattern for all platform microservices to simplify deployments and configuration management.",
				"Implemented a GitLab CI continuous integration system to enable fast, reliable delivery of updated code, increasing development efficiency and reducing delivery errors.",
				"Maintained and optimized high-traffic APIs to ensure availability and performance for multiple market integrations."
			],
			"name": "Scanntech",
			"position": "Senior Software Engineer | Java Backend Developer",
			"startDate": "2021-09-01",
			"summary": "As a software developer at Scanntech, I integrated multiple data sources and retail networks through APIs, maintained high-availability backend services under heavy traffic, improved test coverage, and enhanced integration testing to increase system reliability.",
			"url": "https://scanntech.com"
		},
		{
			"endDate": "2017-12-31",
			"highlights": [
				"Designed and developed a microservices-based online reputation management system.",
				"Provided technical leadership and mentoring across the delivery lifecycle.",
				"Delivered web interfaces (Angular/Vue) and internal REST APIs.",
				"Fixed critical defects and shipped enhancements that improved web performance.",
				"Tech: HTML, CSS, TypeScript, Angular, Vue.js, Java, Spring Boot, JUnit, REST, SQL, PostgreSQL, PHP (Laravel), Python (Flask), Kubernetes, Istio, Docker, JHipster, Linux"
			],
			"name": "Desoft",
			"position": "Web Developer",
			"startDate": "2017-09-01",
			"summary": "Developed and maintained web interfaces and client sites using HTML, CSS and JavaScript. Ensured cross-browser compatibility and responsive layouts.",
			"url": "https://www.desoft.cu"
		},
		{
			"endDate": "2020-08-09",
			"highlights": [
				"Developed dynamic and interactive websites using modern JS frameworks improving user experience and traffic.",
				"Designed processes for cleanup and performance improvements that minimized downtime and increased reliability.",
				"Fixed bugs and implemented enhancements to significantly improve functionality and site speed.",
				"Developed internal APIs for communication between different systems."
			],
			"name": "Desoft",
			"position": "FullStack Developer",
			"startDate": "2018-01-01",
			"summary": "Worked across frontend and backend to deliver robust web solutions; implemented APIs and performance improvements.",
			"url": "https://www.desoft.cu"
		},
		{
			"endDate": "2021-09-01",
			"highlights": [
				"Trained staff in internal web functions and guided the team through implementing new software requirements.",
				"Led adoption of microservices architecture and trained personnel on Kubernetes and Istio.",
				"Designed and implemented the microservice architecture for an online reputation management system."
			],
			"name": "Desoft",
			"position": "Software Architect",
			"startDate": "2020-08-21",
			"summary": "Led architecture design and mentorship efforts; introduced microservices-based patterns and platform improvements.",
			"url": "https://www.desoft.cu"
		}
	]
}
