{
  "title": "Desarrollador Web en Desoft",
  "company": "Desoft",
  "url": "https://www.desoft.cu",
  "icon": "desoft",
  "location": "Ciego de Ávila, Cuba",
  "createDate": "2017-09-01T15:12:23.179Z",
  "published": true,
  "roles": [
    {
      "role": "Desarrollador Web",
      "startDate": "2017-09-01T15:12:23.179Z",
      "endDate": "2017-12-31T15:12:23.179Z",
      "achievements": [
        "Desarrollé interfaces de usuario de sitios web construidas con HTML, CSS, JavaScript.",
        "Desarrollé y solucioné problemas y errores para sitios web internos y de clientes que utilizan principalmente HTML, CSS, JavaScript, TypeScript, Angular y Vuejs.",
        "Sitios probados manualmente en varios navegadores y dispositivos móviles para garantizar la compatibilidad y capacidad de respuesta entre navegadores."
      ]
    },
    {
      "role": "Desarrollador FullStack",
      "startDate": "2018-01-01T15:12:23.179Z",
      "endDate": "2020-08-09T15:12:23.179Z",
      "achievements": [
        "Desarrollé un sitio web dinámico e interactivo que aseguró un alto tráfico, vistas de páginas y experiencia del usuario, lo que resultó en un aumento del 40% en los ingresos por ventas.",
        "Diseñe procesos para la limpieza y la mejora del rendimiento que minimizan el tiempo de inactividad en un 13%.",
        "Corregí errores de sitios web existentes e implementé arreglos que mejoraron significativamente la funcionalidad y velocidad web.",
        "Desarrollé APIs para la comunicación interna entre diferentes sistemas."
      ]
    },
    {
      "role": "Arquitecto de Software",
      "startDate": "2020-08-21T15:12:23.179Z",
      "endDate": "2021-09-01T15:12:23.179Z",
      "achievements": [
        "Capacité a más de 10 miembros del personal en funciones web internas, incluidos los pasos sobre cómo realizar actualizaciones y cambios menores.",
        "Guié y asistí al equipo de desarrollo durante todo el proceso de implementación de los requisitos de software con las nuevas tecnologías.",
        "Capacité a más de 15 miembros del personal en arquitectura de microservicios con Kubernetes e Istio.",
        "Diseñé, implementé y desarrollé una arquitectura de microservicios para el sistema de gestión de reputación online."
      ]
    }
  ]
}
